Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/D10A.tmx
Source language: en_us
Languages: zh_cn

source: Why Does God Love Us?
zh_cn: 上帝为何宠爱我们？

source: This short question is among the most profound questions ever asked.
zh_cn: 这是有史以来最为意义深刻的问题。

source: And no human would ever be able to answer it sufficiently.
zh_cn: 并且，从来没有人能够充分地回答这个问题。

source: One thing is certain, however. God does not love us because we are lovable or because we deserve His love.
zh_cn: 可以确定的是，上帝爱我们并不是因为我们可爱，或是我们值得他的爱。

source: If anything, the opposite is true.
zh_cn: 如果上帝确实是爱我们的，那么其反面才是正确的。

source: The state of mankind since the fall is one of rebellion and disobedience.
zh_cn: 从亚当和夏娃的第一次堕落开始，人类的状态就是反叛和违抗命令之一。

source: Jeremiah 17:9 describes man's inner condition: "The heart is deceitful and desperately wicked. Who can know it?"
zh_cn: 耶利米书第十七章，第九节中，对人类的内心状态描述到：“人心是虚伪的，且绝对邪恶的，而谁又明白这一点？”

source: Our innermost beings are so corrupted by sin that even we don't realize the extent to which sin has tainted us.
zh_cn: 我们内心最深处的存在，由于罪恶而堕落，以至我们无法意识到，是什么罪恶玷污了我们。

source: In our natural state, we do not seek God; we do not love God; we do not desire God.
zh_cn: 我们处于自然状态时，并不会去寻找上帝。我们并不爱上帝，我们也并不渴望见到上帝。

source: Romans 3:10-12 clearly presents the state of the natural, unregenerate person: "There is none righteous, no, not one; There is none who understands; There is none who seeks after God.
zh_cn: 罗马书3:10-12中给我们清晰地展示了不知悔改人类的自然状态：“他们没有一个是正直的，没有，一个都没有；他们没有一个明白；他们没有一个找寻上帝。

source: They have all turned aside; They have together become unprofitable; There is none who does good, no, not one."
zh_cn: 他们全都避到一旁，他们全都是没用的；他们没有一个乐善好施，没有，一个都没有。”

source: How then is it possible for a holy, righteous, and perfect God to love such creatures?
zh_cn: 那么，神圣、正直、完美的上帝又如何会爱这样的生物呢？

source: To understand this we must understand something of the nature and character of God.
zh_cn: 要明白这点，首先要了解自然和上帝的品性。

source: First John 4:8 and 16 tell us that "God is love."
zh_cn: 约翰福音第四章第八节和第16节中告诉我们：“上帝是爱的化身。”

source: Never was a more important declaration made than this; never was more meaning crowded into a few words than in this short sentence--God is love.
zh_cn: 圣经中从未有过比这更重要的声明了，也没有比这个精短的句子——“上帝是爱的化身”更为有意义的句子了。

source: This is a profound statement.
zh_cn: 这是一个意义深远的声明。

source: God doesn't just love; He is love.
zh_cn: 上帝不仅博爱，他就是爱本身。

source: His nature and essence are love.
zh_cn: 他的本性就是爱。

source: Love permeates His very being and infuses all His other attributes, even His wrath and anger.
zh_cn: 爱意弥漫在他的每一个化身，每一个品性，甚至在他的愤怒之中。

source: Because God's very nature is love, He must demonstrate love, just as He must demonstrate all His attributes because doing so glorifies Him.
zh_cn: 因为上帝的本性就是爱，他必须证明爱，就像他必须证明他其他的品性一样，这样，人们才会赞美他。

source: Glorifying God is the highest, the best, and the most noble of all acts, so, naturally, glorifying Himself is what He must do, because He is the highest and the best, and He deserves all glory.
zh_cn: 赞美上帝是所有行为中最高尚的，最美好的，最高贵的。因此，赞美他自己则自然而然地成为他必须做的事情，因为，上帝本身就是最为高尚的，最完美的，他值得这些赞美。

source: Since it is God's essential nature to love, He demonstrates His love by lavishing it on undeserving people who are in rebellion against Him.
zh_cn: 既然爱是上帝最根本的品性，他通过给与那些不值得他爱的人类以爱，来证明他的博爱，即便这些人类反抗他。

source: God's love is not a sappy, sentimental, romantic feeling. Rather, it is agape love, the love of self-sacrifice.
zh_cn: 上帝的爱不是多愁的，感伤的，浪漫的感情，而是，令人吃惊的，自我牺牲的爱。

source: He demonstrates this sacrificial love by sending His Son to the cross to pay the penalty for our sin (1 John 4:10), by drawing us to Himself (John 6:44), by forgiving us of our rebellion against Him, and by sending His Holy Spirit to dwell within us, thereby enabling us to love as He loves.
zh_cn: 他把自己的儿子耶稣派到尘世，而因为我们的罪恶，耶稣被钉到十字架上，处以死刑（约翰福音 4:10）；根据他的样子，创造了我们（约翰福音 6：44）；我们反抗他时，原谅我们；将圣灵降落于尘世，与我们一同生活，让我们可以向他爱我们一样去爱。通过这样的方式，向我们证明他自我牺牲的爱。

source: He did this in spite of the fact that we did not deserve it.
zh_cn: 即便我们不值得，他还是做了。

source: "But God demonstrates His own love for us in this: While we were still sinners, Christ died for us" (Romans 5:8).
zh_cn: “但是上帝用这样的方式向我们证明了他的爱：在我们还是罪人之时，耶稣却为了我们而死。”（罗马书5:8）

source: God's love is personal.
zh_cn: 上帝的爱是私人的。

source: He knows each of us individually and loves us personally.
zh_cn: 他认识和爱我们中的任何一个人。

source: His is a mighty love that has no beginning and no end.
zh_cn: 他的爱是伟大的，既无开始也无结束。

source: It is this experiencing of God's love that distinguishes Christianity from all other religions.
zh_cn: 正是体验到了上帝的这种爱，让基督徒们有别于其他信徒。

source: Why does God love us?
zh_cn: 为什么上帝会爱我们？

source: It is because of who He is: "God is love."
zh_cn: 那是因为：“他就是爱的化身。”
